# LegendTextTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..LegendTextTypeId Property
SpatialFieldManager Class See Also
---
Stores element id of text associated with common (result-independent) part of legend in view.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId LegendTextTypeId { get; set; }
```

Visual Basic
---
```text
Public Property LegendTextTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LegendTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace